NextFOAM-2409/tutorials/heatTransfer/chtMultiRegionSimpleFoam/heatExchanger/constant/air/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airToporous
{
    type            constantHeatTransfer;

    interpolationMethod cellVolumeWeight;
    nbrRegion       porous;
    master          false;

    nbrModel        porousToair;
    fields          (h);
    semiImplicit    no;
}

porosityBlockage
{
    type            interRegionExplicitPorositySource;

    interRegionExplicitPorositySourceCoeffs
    {
        interpolationMethod cellVolumeWeight;
        nbrRegion       porous;

        type            DarcyForchheimer;

        d   (-1000 -1000 1e4);
        f   (0 0 0);

        coordinateSystem
        {
            origin  (0 0 0);
            e1      (0 1 0);
            e2      (0 0 1);
        }
    }
}


// ************************************************************************* //
